<?php
/*
* @author: Husein JavaDLE
* https://github.com/JavaDle
*/
/*
|--------------------------------------------------------------------------
| Updater Language Lines
|--------------------------------------------------------------------------
*/

return [
    'SYSTEM_VERSION' => 'Версия системы: ',
    'PERMISSION_DENIED' => 'Пользователь не авторизован для выполнения обновлений.',
    'ALREADY_UPDATED' => 'Система УЖЕ ОБНОВЛЕНА до последней версии.',
    'UPDATE_AVAILABLE' => 'Доступно обновление.',
    'UPDATE_NOW' => 'Обновить.',
    'BACKUP' => 'Создана папка для резервных копий.',
    'BACKUP_FOUND' => 'Обнаружена резервная копия: ',
    'DOWNLOADING' => 'Загрузка обновления...',
    'DOWNLOADING_SUCCESS' => 'Обновление успешно загружено.',
    'DOWNLOADING_ERROR' => 'Произошла ошибка во время загрузки.',
    'MAINTENANCE_MODE_ON' => 'Режим обслуживания: ВКЛ',
    'MAINTENANCE_MODE_OFF' => 'Режим обслуживания: ВЫКЛ',
    'INSTALLATION_SUCCESS' => 'Обновление успешно установлено.',
    'INSTALLATION_ERROR' => 'Произошла ошибка во время установки.',
    'RECOVERY' => 'Мастер обновлений пытается восстановить вашу систему из резервной копии.',
    'RECOVERY_SUCCESS' => 'Восстановление успешно завершено.',
    'RECOVERY_ERROR' => 'Восстановление не удалось, попробуйте выполнить его вручную. Помните: \'php artisan up\' для отключения режима обслуживания.',
    'EXCEPTION' => 'Произошло исключение: ',
    'CHANGELOG' => 'Изменения:',
    'DIRECTORY_CREATED' => 'Создан каталог: ',
    'FILE_EXIST' => 'Файл существует: ',
    'FILE_COPIED' => 'Файл скопирован: ',
    'EXECUTE_UPDATE_SCRIPT' => 'Выполните скрипт, включенный в обновление.',
    'TEMP_CLEANED' => 'Временные файлы удалены.',
];

